src/ChartsOfCalculationTypes/инкУдержания/инкУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>инкУдержания</name>
  <baseCalculationTypes>ChartOfCalculationTypes.инкНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.инкУдержания</baseCalculationTypes>
  <predefined>
    <items>
      <name>Аванс</name>
      <description>Аванс</description>
    </items>
    <items>
      <name>Алименты</name>
      <description>Алименты</description>
    </items>
    <items>
      <name>ВыплатаОтпускныхИБЛВТекущемМесяце</name>
      <description>Выпл. отпуск. и б/л в текущем месяце</description>
    </items>
    <items>
      <name>ДобровольныеВзносы</name>
      <description>Добровольные взносы</description>
    </items>
    <items>
      <name>Долг</name>
      <description>Долг</description>
    </items>
    <items>
      <name>ЗарплатаПредыдущегоМесяца</name>
      <description>Зарплата предыдущего месяца</description>
    </items>
    <items>
      <name>ЗарплатаТекущегоМесяца</name>
      <description>Зарплата текущего месяца</description>
    </items>
    <items>
      <name>ЗарплатаТекущегоМесяцаДо22</name>
      <description>Зарплата текущего месяца до 22</description>
    </items>
    <items>
      <name>ЗарплатаТекущегоМесяцаПосле22</name>
      <description>Зарплата текущего месяца после 22</description>
    </items>
    <items>
      <name>ИсполнительныйЛист</name>
      <description>Исполнительный лист</description>
    </items>
    <items>
      <name>МежрасчетныеВыплаты</name>
      <description>Межрасчетные выплаты</description>
    </items>
    <items>
      <name>НДФЛ</name>
      <description>НДФЛ</description>
    </items>
    <items>
      <name>Подарки</name>
      <description>Подарки</description>
    </items>
    <items>
      <name>ПрофсоюзныйВзнос</name>
      <description>Профсоюзный взнос</description>
    </items>
    <items>
      <name>ПрочиеУдержания</name>
      <description>Прочие удержания</description>
    </items>
  </predefined>
  <attributes>
    <name>ВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кредит</name>
    <type>
      <types>ChartOfAccountsRef.инкХозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВСтаройПрограмме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/ChartsOfCalculationTypes/инкУдержания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Процедура - Обновление 11 0 2 43
//
Процедура Обновление_11_0_2_43() Экспорт
	
	УдержаниеСтруктура = Новый Структура;   
	УдержаниеСтруктура.Вставить("Код","20004");
	УдержаниеСтруктура.Вставить("Наименование","Добровольные взносы");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ДобровольныеВзносы");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	
КонецПроцедуры

// Процедура - Заполнить коды удержаний 11 0 2 13
//
Процедура ЗаполнитьКодыУдержаний_11_0_2_13() Экспорт
	
	// ЗП текущего месяца до 22:
	УдержаниеСтруктура = Новый Структура;   
	УдержаниеСтруктура.Вставить("Код","10502");
	УдержаниеСтруктура.Вставить("Наименование","ЗП текущего месяца до 22 числа (включительно)");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаТекущегоМесяцаДо22");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// ЗП текущего месяца после 22:
	УдержаниеСтруктура = Новый Структура;   
	УдержаниеСтруктура.Вставить("Код","10503");
	УдержаниеСтруктура.Вставить("Наименование","ЗП текущего месяца после 22 числа");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаТекущегоМесяцаПосле22");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	

КонецПроцедуры                                      

// Процедура - Заполнить коды удержаний 11 0 0 11
//
Процедура ЗаполнитьКодыУдержаний_11_0_0_11() Экспорт
	
	Кредит50 = 	ПланыСчетов.инкХозрасчетный.Касса;
	Кредит51 = 	ПланыСчетов.инкХозрасчетный.РасчетныеСчета;
	Кредит76 =  ПланыСчетов.инкХозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами;
	
	// Аванс:
	УдержаниеСтруктура = Новый Структура;
	УдержаниеСтруктура.Вставить("Код","10001");
	УдержаниеСтруктура.Вставить("Наименование","Аванс");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","Аванс");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит",Кредит50);
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00080");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Выпл. отпуск. и б/л в текущем месяце:
	УдержаниеСтруктура = Новый Структура;  
	УдержаниеСтруктура.Вставить("Код","10002");
	УдержаниеСтруктура.Вставить("Наименование","Выпл. отпуск. и б/л в текущем месяце");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ВыплатаОтпускныхИБЛВТекущемМесяце");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00400");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// ЗП текущего месяца :
	УдержаниеСтруктура = Новый Структура;   
	УдержаниеСтруктура.Вставить("Код","10003");
	УдержаниеСтруктура.Вставить("Наименование","ЗП текущего месяца");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаТекущегоМесяца");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00500");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// ЗП предыдущего месяца:
	УдержаниеСтруктура = Новый Структура; 
	УдержаниеСтруктура.Вставить("Код","10004");
	УдержаниеСтруктура.Вставить("Наименование","ЗП предыдущего месяца");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаПредыдущегоМесяца");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00501");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Межрасчетные выплаты:
	УдержаниеСтруктура = Новый Структура;    
	УдержаниеСтруктура.Вставить("Код","10005");
	УдержаниеСтруктура.Вставить("Наименование","Межрасчетные выплаты");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","МежрасчетныеВыплаты");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит",Кредит50);
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00081");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Профсоюзный взнос:
	УдержаниеСтруктура = Новый Структура;
	УдержаниеСтруктура.Вставить("Код","10008");
	УдержаниеСтруктура.Вставить("Наименование","Профсоюзный взнос");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ПрофсоюзныйВзнос");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
КонецПроцедуры                                      

// Процедура - Заполнить коды удержаний 11 0 2 2
//
Процедура ЗаполнитьКодыУдержаний_11_0_2_2() Экспорт
	
	Кредит50 = 	ПланыСчетов.инкХозрасчетный.Касса;
	Кредит51 = 	ПланыСчетов.инкХозрасчетный.РасчетныеСчета;
	Кредит76 =  ПланыСчетов.инкХозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами;
	
	// Аванс:
	УдержаниеСтруктура = Новый Структура;
	УдержаниеСтруктура.Вставить("Код","10080");
	УдержаниеСтруктура.Вставить("Наименование","Аванс");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","Аванс");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит",Кредит50);
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00080");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Выпл. отпуск. и б/л в текущем месяце:
	УдержаниеСтруктура = Новый Структура;  
	УдержаниеСтруктура.Вставить("Код","10400");
	УдержаниеСтруктура.Вставить("Наименование","Выпл. отпуск. и б/л в текущем месяце");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ВыплатаОтпускныхИБЛВТекущемМесяце");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00400");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// ЗП текущего месяца :
	УдержаниеСтруктура = Новый Структура;   
	УдержаниеСтруктура.Вставить("Код","10501");
	УдержаниеСтруктура.Вставить("Наименование","ЗП текущего месяца");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаТекущегоМесяца");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00501");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// ЗП предыдущего месяца:
	УдержаниеСтруктура = Новый Структура; 
	УдержаниеСтруктура.Вставить("Код","10500");
	УдержаниеСтруктура.Вставить("Наименование","ЗП предыдущего месяца");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ЗарплатаПредыдущегоМесяца");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00500");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Межрасчетные выплаты:
	УдержаниеСтруктура = Новый Структура;    
	УдержаниеСтруктура.Вставить("Код","10081");
	УдержаниеСтруктура.Вставить("Наименование","Межрасчетные выплаты");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","МежрасчетныеВыплаты");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит",Кредит50);
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00081");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
	// Профсоюзный взнос:
	УдержаниеСтруктура = Новый Структура;
	УдержаниеСтруктура.Вставить("Код","20002");
	УдержаниеСтруктура.Вставить("Наименование","Профсоюзный взнос");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","ПрофсоюзныйВзнос");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	
	//	
	// Алименты:
	УдержаниеСтруктура = Новый Структура;
	УдержаниеСтруктура.Вставить("Код","10097");
	УдержаниеСтруктура.Вставить("Наименование","Алименты");
	УдержаниеСтруктура.Вставить("ИмяПредопределенныхДанных","Алименты");
	УдержаниеСтруктура.Вставить("ВПроцентах",Ложь);
	УдержаниеСтруктура.Вставить("Кредит");
	УдержаниеСтруктура.Вставить("КодВСтаройПрограмме","00097");
	ОписатьКодУдержанияСтруктура(УдержаниеСтруктура);
	//	
	
КонецПроцедуры                                      

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОписатьКодУдержанияСтруктура(УдержаниеСтруктура)
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовРасчета.инкУдержания." + УдержаниеСтруктура.ИмяПредопределенныхДанных);
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();                                      
	Иначе
		Элемент = ПланыВидовРасчета.инкУдержания.СоздатьВидРасчета();
	КонецЕсли;
                       
	ЗаполнитьЗначенияСвойств(Элемент,УдержаниеСтруктура);	
	Элемент.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
